{
    "jersey_url": "s3://lbbw-trikot/input-assets/Trikot_a.png",
    "wappen_url": "s3://lbbw-trikot/input-assets/Logo_4.png",
    "locations": {
        "stadion": {
            "urls": [
                "s3://lbbw-trikot/input-assets/locations/1.png",
                "s3://lbbw-trikot/input-assets/locations/2.png"
            ],
            "FluxKontextCalls": {
                "1": "the {gender} is wearing a loose fitting grey tank top. Present the {gender} with natural, balanced body proportions, photographed with a standard portrait lens from a comfortable distance. The head should appear proportionate to the body, with no exaggeration or distortion. Revert any lens distortion. Keep the facial features, hair and expression of the person consistent. Change the background to the soccer stadium and the light to a soft golden hour. Keep everything consistent.",
                "2": "Put the white soccer jersey on the {gender}. Maintain all the small details of the soccer jersey including color and the logos and the embossed pattern on the white fabric of the jersey: The base color of the jersey is white, with a visually dynamic design featuring fine, textured, geometric embossments across the torso and lower front. These raised patterns add depth and tactile quality to the fabric, suggesting a high-performance polyester blend, commonly used in modern football kits for moisture-wicking and breathability. The material appears to be lightweight and stretchable, tailored for athletic performance.\n\nThe most striking element is the red chest band, which runs horizontally across the front. This band is stylized with jagged, fragmented edges and arrow-like design elements, giving it a contemporary, disruptive look while maintaining the club’s traditional red band motif. This chest band contains the white sponsor logo \"LBBW\" (Landesbank Baden-Württemberg), rendered in bold, capital letters with a double-equals sign in the middle.\n\nClub Crest: Located on the left chest, the VfB Stuttgart crest features a shield design. The top part has red stylized antlers and the letters “VfB” in a gothic script, while the lower yellow portion includes three black deer antlers—a symbol of Württemberg. Above the crest is a single gold star, denoting the club’s historic Bundesliga titles.\n\nManufacturer Logo: On the right chest is the JAKO logo in red.\nAvoid any black or grey patches above the hem.\nAdditional Sponsor Logos: \n\nRight Sleeve: Displays the black two-line \"·h so\" logo in lowercase Helvetica Bold font.\n\nShoulder Dot Detail\nEach shoulder features a row of five circles, consisting of the circular JAKO logomark next to the collar and more dynamic circular dot patterns arranged in a row, representing the iconic \"JAKO Dots\" brand element in red.\n\nCollar and Cut\nThe jersey has a modern V-neck collar with a slight cross-over construction at the sharp corner in the center, adding to the premium and sporty appearance.\n\nKeep face, hair and scenic photo background consistent, enhance the facial details."

            }
        },
        "fanmeile": {
            "urls": [
                "s3://lbbw-trikot/input-assets/locations/4.png",
                "s3://lbbw-trikot/input-assets/locations/5.png"
            ],
            "FluxKontextCalls": {
                "1": "medium close up of the {gender} is wearing a loose fitting grey tank top. Present the {gender} with natural, balanced body proportions, photographed with a standard portrait lens. The head should appear proportionate to the body, with no exaggeration or distortion. Revert any lens distortion. Keep the facial features, hair and expression of the {gender} consistent. Change the background to a massive celebration of soccer fans from within the crowd. The camera follows a large group of people walking down a narrow European city street. An immense shower of red and white rectangular confetti flutters down, filling the air. A large red and white flag is being waved in the distance, partially obscured by the crowd and confetti. Red and white rectangular confetti also blurry in the foreground. Keep everything consistent.",
                "2": "Put the white soccer jersey on the {gender} and keep the original background. The {gender} is standing in a massive shower of red and white rectangular confetti filling the air. Confetti is flying everywhere. Maintain all the small details of the soccer jersey including color and the logos and the embossed pattern on the white fabric of the jersey: The base color of the jersey is white, with a visually dynamic design featuring fine, textured, geometric embossments across the torso and lower front. These raised patterns add depth and tactile quality to the fabric, suggesting a high-performance polyester blend, commonly used in modern football kits for moisture-wicking and breathability. The material appears to be lightweight and stretchable, tailored for athletic performance.\n\nThe bottom left part of the jersey is clean white with the embossed pattern without other elements.\n\nThe most striking element is the red chest band, which runs horizontally across the front. This band is stylized with jagged, fragmented edges and arrow-like design elements, giving it a contemporary, disruptive look while maintaining the club’s traditional red band motif. This chest band contains the white sponsor logo \"LBBW\" (Landesbank Baden-Württemberg), rendered in bold, capital letters with a double-equals sign in the middle.\n\nClub Crest: Located on the left chest, the VfB Stuttgart crest features a shield design. The top part has red stylized antlers and the letters “VfB” in a gothic script, while the lower yellow portion includes three black deer antlers—a symbol of Württemberg. Above the crest is a single gold star, denoting the club’s historic Bundesliga titles.\n\nManufacturer Logo: On the right chest is the JAKO logo in red.\n\nAdditional Sponsor Logos: \n\nRight Sleeve: Displays the black two-line \"·h so\" logo in lowercase Helvetica Bold font.\n\nShoulder Dot Detail\nEach shoulder features a row of five circles, consisting of the circular JAKO logomark next to the collar and more dynamic circular dot patterns arranged in a row, representing the iconic \"JAKO Dots\" brand element in red.\n\nCollar and Cut\nThe jersey has a modern V-neck collar with a slight cross-over construction at the sharp corner in the center, adding to the premium and sporty appearance.\n\nKeep face, hair and scenic photo background consistent.\nEnhance the facial details."

            }
        }
    }
}